Documents/ВходящаяТранспортнаяОперацияВЕТИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>ВходящаяТранспортнаяОперацияВЕТИС</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СерияТТН</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаВЕТИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрузоотправительПредприятие</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредприятияВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТТН</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаВЕТИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрузоотправительХозяйствующийСубъект</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйствующиеСубъектыВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрузополучательХозяйствующийСубъект</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйствующиеСубъектыВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрузополучательПредприятие</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредприятияВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеВходящаяТранспортнаяОперацияВЕТИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаТТН</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТТН</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДокументовВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособХранения</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыХраненияПриТранспортировкеВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеревозчикХозяйствующийСубъект</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйствующиеСубъектыВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТранспортногоСредства</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаВЕТИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВетеринарноСопроводительныйДокумент</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ВетеринарноСопроводительныйДокументВЕТИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатПроверкиПравилРегионализации</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:EnumRef.РезультатыПроверкиПравилРегионализации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукция</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ПродукцияВЕТИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоВЕТИС</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СерияНоменклатурыВЕТИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмеренияВЕТИС</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмеренияВЕТИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозвращаемоеКоличествоВЕТИС</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПартии</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СтрокаВЕТИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МаршрутВозврата</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Маршрут</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТоварыУточнение</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВходящаяТранспортнаяОперацияВЕТИС/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&Вместо("ОбработкаПроверкиЗаполнения")
Процедура КочетовОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		МассивНепроверяемыхРеквизитов = Новый Массив;
	
	ПеревозкаОтсутствует = ГрузоотправительПредприятие = ГрузополучательПредприятие;
	
	ПроверкаРеквизитаНеВыполняется = Новый Соответствие;
	ПроверкаРеквизитаНеВыполняется.Вставить("ГрузоотправительПредприятие", ГашениеНаСВХ);
	ПроверкаРеквизитаНеВыполняется.Вставить("ГрузоотправительХозяйствующийСубъект", ГашениеНаСВХ);
	ПроверкаРеквизитаНеВыполняется.Вставить("ДатаТТН", Не ТТНУказан Или ПеревозкаОтсутствует Или ГашениеНаСВХ);
	ПроверкаРеквизитаНеВыполняется.Вставить("НомерТТН", Не ТТНУказан Или ПеревозкаОтсутствует Или ГашениеНаСВХ);
	ПроверкаРеквизитаНеВыполняется.Вставить("СерияТТН", Не ТТНУказан Или ПеревозкаОтсутствует Или ГашениеНаСВХ);
	ПроверкаРеквизитаНеВыполняется.Вставить("ТипТТН", Не ТТНУказан Или ПеревозкаОтсутствует Или ГашениеНаСВХ);
	ПроверкаРеквизитаНеВыполняется.Вставить("НомерАвтомобильногоКонтейнера", ПеревозкаОтсутствует Или ГашениеНаСВХ);
	ПроверкаРеквизитаНеВыполняется.Вставить("НомерАвтомобильногоПрицепа", ПеревозкаОтсутствует Или ГашениеНаСВХ);
	ПроверкаРеквизитаНеВыполняется.Вставить("НомерТранспортногоСредства", ПеревозкаОтсутствует Или ГашениеНаСВХ Или ТипТранспорта = Перечисления.ТипыТранспортаВЕТИС.ПерегонСкота);
	ПроверкаРеквизитаНеВыполняется.Вставить("ТипТранспорта", ПеревозкаОтсутствует Или ГашениеНаСВХ);
	ПроверкаРеквизитаНеВыполняется.Вставить("ПеревозчикХозяйствующийСубъект", ПеревозкаОтсутствует Или ГашениеНаСВХ);
	ПроверкаРеквизитаНеВыполняется.Вставить("СпособХранения", ПеревозкаОтсутствует Или ГашениеНаСВХ);
	
	Для каждого ПроверяемыйРеквизит Из ПроверяемыеРеквизиты Цикл
		Если ПроверкаРеквизитаНеВыполняется.Получить(ПроверяемыйРеквизит) = Истина Тогда
			МассивНепроверяемыхРеквизитов.Добавить(ПроверяемыйРеквизит);
		КонецЕсли;
	КонецЦикла;
	
	Если Не ПеревозкаОтсутствует И Не ГашениеНаСВХ Тогда
		Если ТипТранспорта = Перечисления.ТипыТранспортаВЕТИС.ПерегонСкота Тогда
			РеквизитыТранспортногоСредства = "ТипТранспорта";
		Иначе
			РеквизитыТранспортногоСредства = "НомерАвтомобильногоКонтейнера,НомерАвтомобильногоПрицепа,НомерТранспортногоСредства,ТипТранспорта";
		КонецЕсли;
		
		ТранпортноеСредствоЗаполнено = Истина;
		Для каждого РеквизитТранспортногоСредства Из СтрРазделить(РеквизитыТранспортногоСредства, ",") Цикл
			Если ПроверяемыеРеквизиты.Найти(РеквизитТранспортногоСредства) <> Неопределено
				И Не ЗначениеЗаполнено(ЭтотОбъект[РеквизитТранспортногоСредства]) Тогда
				МассивНепроверяемыхРеквизитов.Добавить(РеквизитТранспортногоСредства);
				ТранпортноеСредствоЗаполнено = Ложь;
			КонецЕсли;
		КонецЦикла;
		Если Не ТранпортноеСредствоЗаполнено Тогда
			ТекстОшибки = НСтр("ru = 'Не все данные транспортного средства заполнены'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "ПредставлениеТранспортногоСредства",, Отказ);
		КонецЕсли;
	КонецЕсли;
			
	ПредставлениеТЧ = ЭтотОбъект.Метаданные().ТабличныеЧасти.Товары.Синоним;
	ТипЖивыеЖивотные =
		ИнтеграцияВЕТИСВызовСервера.ПродукцияПринадлежитТипуЖивыеЖивотные(ЭтотОбъект.Товары.ВыгрузитьКолонку("Продукция"));
	
	Для каждого СтрокаТовары Из Товары Цикл
		
		Если СтрокаТовары.ЕстьУточнения Тогда
			
			ОтборУточнений = Новый Структура("ИдентификаторСтроки", СтрокаТовары.ИдентификаторСтроки);
			ТоварыУточнения = ТоварыУточнение.НайтиСтроки(ОтборУточнений);
			Если ТоварыУточнения.Количество() = 0 Или Не ЗначениеЗаполнено(ТоварыУточнения.Получить(0).Номенклатура) Тогда
				Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", СтрокаТовары.НомерСтроки, "ЕстьУточнения");
				ШаблонСообщенияСроки = НСтр("ru = 'Нет данных по уточнямым товарам в строке %1 списка ""%2""'");
				ТекстСообщения = СтрШаблон(ШаблонСообщенияСроки, СтрокаТовары.НомерСтроки, ПредставлениеТЧ);
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле,, Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТовары.Продукция)
			И НЕ ЗначениеЗаполнено(СтрокаТовары.СрокГодностиНачалоПериода)
			И НЕ ТипЖивыеЖивотные[СтрокаТовары.Продукция]
			И ИнтеграцияВЕТИСВызовСервера.ПродукцияИмеетСрокГодности(СтрокаТовары.Продукция) Тогда
			
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", СтрокаТовары.НомерСтроки, "ПредставлениеСрокГодности");
			ШаблонСообщенияСроки = НСтр("ru = 'Не заполнено поле ""%1"" в строке %2 списка ""%3""'");
			ТекстСообщения = СтрШаблон(ШаблонСообщенияСроки, НСтр("ru = 'Срок годности'"),	СтрокаТовары.НомерСтроки, ПредставлениеТЧ);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле,, Отказ);
			
		КонецЕсли;
		
		//Если ЗначениеЗаполнено(СтрокаТовары.Номенклатура) И СтрокаТовары.Количество = 0 Тогда
		//	
		//	Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", СтрокаТовары.НомерСтроки, "Количество");
		//	ШаблонСообщенияСроки = НСтр("ru = 'Не заполнено поле ""%1"" в строке %2 списка ""%3""'");
		//	ТекстСообщения = СтрШаблон(ШаблонСообщенияСроки, НСтр("ru = 'Количество'"),	СтрокаТовары.НомерСтроки, ПредставлениеТЧ);
		//	
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле,, Отказ);
		//	
		//КонецЕсли;
		
	КонецЦикла;
	
	ИнтеграцияВЕТИСПереопределяемый.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

КонецПроцедуры

#КонецЕсли
